api/app/controllers/cards_controller.rb

  def create
    @card = Card.new(card_params)

    if @card.save
---
INSERT INTO "cards" ("name", "quantity", "card_type", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)