api/app/controllers/scratchpads_controller.rb

  def index
    @scratchpads = Scratchpad.all
---
SELECT "scratchpads".* FROM "scratchpads"

  def create
    @scratchpad = Scratchpad.new(scratchpad_params)

    if @scratchpad.save
---
INSERT INTO "scratchpads" ("text", "created_at", "updated_at") VALUES (?, ?, ?)  [["text", "Score: Me 1 - React 0!"], ["created_at", "2021-04-12 19:42:58.674787"], ["updated_at", "2021-04-12 19:42:58.674787"]]